04_Simulation/PH_2D_RANS_kOmegaSSTx_baseline_pimpleURANS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.1;   //0.01
        smoother        GaussSeidel; //DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }

    "(U|k|epsilon|omega|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

//    p {
//        solver          GAMG;
//        smoother        GaussSeidel;
//        cacheAgglomeration true;
//        nCellsInCoarsestLevel 10;
//        agglomerator    faceAreaPair;
//        mergeLevels     1;
//        tolerance       1e-05;
//        relTol          0.05;
//    }
//
//    pFinal {
//        $p;
//        tolerance       1e-05;
//        relTol          0.05;
//    }
//
//    "(U|k)"
//    {
//        solver          smoothSolver;
//        smoother        GaussSeidel;
//        nSweeps         2;
//        tolerance       1e-07;
//        relTol          0.01;
//    }
//
//    omega {
//        $k;
//        tolerance       1e-11;
//    }
//
//    "(U|k|omega)Final"
//    {
//        $U;
//        tolerance       1e-12;
//        relTol          0.01;
//    }

}

//SIMPLE
//{
//    nNonOrthogonalCorrectors 0;
//    pRefCell            0;
//    pRefValue           0;
//
//    residualControl
//    {
//        p               1e-10;
//        U               1e-10;
//        k               1e-10;
//        omega           1e-10;
//    }
//}

//PISO
//{
//    nCorrectors     2;
//    nNonOrthogonalCorrectors 0;
//    pRefCell        0;
//    pRefValue       0;
//}

//PIMPLE
//{
//    nOuterCorrectors    1;
//    nCorrectors         2;
//    nNonOrthogonalCorrectors 0;
//    pRefCell            0;
//    pRefValue           0;
//}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors              1;
    nOuterCorrectors         50;
    pRefCell                 0;
    pRefValue                0;
 
    residualControl
    {
        U
        {
                tolerance  1e-7;
                relTol      0;
        }
        p
        {
                tolerance  1e-7;
                relTol      0;
        }
     }
}
 
relaxationFactors
{
    fields
    {
        p      0.3;
        pFinal   1;
    }
    equations
    {
        "U|k|epsilon|omega"          0.3;
        "(U|k|epsilon|omega)Final"   1;
    }
}

// ************************************************************************* //
